[
  {
    "id": 1,
    "name": "ที่มาของวุฒิสภา",
    "image": "https://elect.in.th/con/images/topic1.jpg",
    "thumbnail_image": "https://elect.in.th/con/images/topic1_thumbnail.png",
    "og_image": "https://elect.in.th/con/images/topic1_thumbnail.png",
    "category_id": "legislative",
    "category_name": "อำนาจนิติบัญญัติ",
    "subcategory_id": "1029",
    "subcategory_name": "สมาชิกวุฒิสภา",
    "summary": "# ความเป็นมา\n\nวุฒิสภาไทยมีที่มาหลากหลายขึ้นอยู่กับรัฐธรรมนูญแต่ละฉบับ ส่วนมากแล้ววุฒิสภานั้นมาจากการแต่งตั้งโดยพระมหากษัตริย์ และคณะกรรมการสรรหา น้อยครั้งที่วุฒิสมาชิกจะมาจากการเลือกตั้งของประชาชน มีเพียงรัฐธรรมนูญพ.ศ. 2489  และรัฐธรรมนูญพ.ศ. 2540 เท่านั้นที่สมาชิกวุฒิสภาทั้งหมดมาจากการเลือกตั้ง\n\n|  | เลือกโดย | จำนวน ส.ว.<br/>![](https://elect.in.th/con/images/topic1_summary_table1_legend.png) |\n|----|----|----|\n| ฉบับ ชั่วคราว 2475 | - | - |\n| ฉบับ 2475 | - | - |\n| ฉบับ 2489 | ประชาชน | 80 คน<br/>![](https://elect.in.th/con/images/topic1_summary_table1_mp80.png) |\n| ฉบับชั่วคราว 2490 | พระมหากษัตริย์ | เท่าสภาผู้แทนราษฎร |\n| ฉบับ 2492 | พระมหากษัตริย์ | 100 คน<br/>![](https://elect.in.th/con/images/topic1_summary_table1_senate270.png) |\n| ฉบับ 2475 แก้ไข 2495 | - | - |\n| ฉบับ 2502 | - | - |\n\n# 10 ส.ว. \"ไม่รับหลักการ\" ตั้ง สสร. แต่ได้เป็น กมธ. พิจารณารายละเอียด\n \nการแก้ไขรัฐธรรมนูญเพื่อตั้ง สสร. มีโมเดลหลักอยู่สามโมเดล คือ “โมเดลพรรคร่วมรัฐบาล” ให้ สรร. มาจาการเลือกตั้ง ผสมการแต่งตั้ง หรือ “โมเดลพรรคเพื่อไทย” ที่ให้ สสร.มาจากการเลือกตั้งแบบแบ่งเขตเลือกตั้ง ซึ่งทั้งสองโมเดลเป็นสองร่างรัฐธรรมนูญที่สภารับหลักการ และ “โมเดลภาคประชาชน” ที่ให้ สสร. มาจากการเลือกตั้งโดยใช้ประเทศเป็นเขตเลือกตั้ง แม้ร่างรัฐธรรมนูญฉบับภาคประชาชนจะถูกปัดทิ้งไป แต่ กมธ.จะยกขึ้นมาประกอบในการพิจารณาด้วย\n \nแม้ยังไม่แน่ชัดว่าโมเดล สสร. สุดท้ายที่ออกมาหลังการพิจารณาโดย กมธ. ชุดนี้จะมีหน้าตาเป็นเช่นไร แต่ชัดเจนว่า วันที่ 18 พฤศจิกายน 2563 สมาชิกรัฐสภาลงมติเห็นชอบในหลักการให้มีการแก้ไขรัฐธรรมนูญเปิดทางให้มี สสร. เพื่อเข้ามาร่างรัฐธรรมนูญใหม่ \n \nอย่างไรก็ตามในบรรดา กมธ.แก้รัฐธรรมนูญฯ จำนวนทั้ง 45 คน พบว่า มี 10 คน ที่ \"ไม่\" ลงมติรับหลักการร่างรัฐธรรมนูญที่เปิดทางให้มีการตั้ง สสร. ซึ่งทั้งหมดเป็น ส.ว. และในจำนวนนั้นมี 2 คน ที่ \"ไม่\" ลงมติไม่เห็นชอบกับการแก้ไขรัฐธรรมนูญร่างใดเลย คือ มหรรณพ เดชวิทักษ์ และ เสรี สุวรรณภานนท์",
    "constitutions": [
      {
        "id": 0,
        "name": "รัฐธรรมนูญแห่งราชอาณาจักรไทย พุทธศักราช 2560",
        "prelude": "",
        "sections": [
          {
            "id": 107,
            "content": "วุฒิสภาประกอบด้วยสมาชิกจำนวนสองร้อยคน ซึ่งมาจาก \\n การเลือกกันเองของบุคคลซึ่งมีความรู้ ความเชี่ยวชาญ ประสบการณ์ อาชีพ ลักษณะ หรือประโยชน์ร่วมกัน หรือ \\n ..",
            "chapterId": 7,
            "chapterName": "รัฐสภา",
            "partId": 3,
            "partName": "วุฒิสภา",
            "amendmentIds": []
          },
          {
            "id": 269,
            "content": "ในวาระเริ่มแรก ให้วุฒิสภาประกอบด้วยสมาชิกจำนวน \\n สองร้อยห้าสิบคน ซึ่งพระมหากษัตริย์ทรงแต่งตั้งตามที่ \\n คณะรักษาความสงบแห่งชาติถวายคำแนะนำ โดยในการ\\n ....",
            "chapterId": 17,
            "chapterName": "บทเฉพาะกาล",
            "partId": null,
            "partName": null,
            "amendmentIds": [1]
          }
        ],
        "amendments": [
          {
            "id": 1,
            "type": "sectionEdit",
            "affectedSectionId": 269,
            "content": "ในวาระเริ่มแรก ให้วุฒิสภาประกอบด้วยสมาชิกจำนวนสองร้อยห้าสิบคน ซึ่งพระมหากษัตริย์ทรงแต่งตั้งตามที่คณะรักษาความสงบแห่งชาติถวายคำแนะนำ โดยในการสรรหาและแต่งตั้งให้ดำเนินการตามหลักเกณฑ์และวิธีการ ดังต่อไปนี้",
            "affectedBy": "แก้ไขเพิ่มเติม (ฉบับที่ 5) พุทธศักราช 2538",
            "remark": ""
          }
        ]
      }
    ],
    "opinions": [
      {
        "id": 543,
        "speaker_name": "เสรี วงษ์มณฑา",
        "speaker_position": "ประธานกรรมการในคณะกรรมการปฏิรูปประเทศด้านการสื่อสารมวลชน เทคโนโลยีสารสนเทศ",
        "speaker_image": "http://www.nfc.co.th/uploads/director/20200428/degoqrwz0158.jpg",
        "content": "เลือกที่จะเล่าบางส่วนของประวัติศาสตร์เข้าข้างตัวเอง เพื่อให้บรรลุเป้าหมายทางการเมืองที่ต้องการ ปลุกเร้าเยาวชนของชาติให้คล้อยตามเรื่องการเปลี่ยนระบอบการปกครอง เลวค่ะ"
      },
      {
        "id": 543,
        "speaker_name": "อ. ฐิติรัตน์ ทิพย์สัมฤทธิ์กุล",
        "speaker_position": "อาจารย์ประจำศูนย์กฎหมายระหว่างประเทศ คณะนิติศาสตร์ มหาวิทยาลัยธรรมศาสตร์",
        "speaker_image": "http://www.law.tu.ac.th/wp-content/uploads/2014/09/%E0%B8%AD%E0%B8%B2%E0%B8%88%E0%B8%B2%E0%B8%A3%E0%B8%A2%E0%B9%8C-%E0%B8%90%E0%B8%B4%E0%B8%95%E0%B8%B4%E0%B8%A3%E0%B8%B1%E0%B8%95%E0%B8%99%E0%B9%8C.jpg",
        "content": "ทุกวันนี้มีอยู่แล้ว และใช้ข้อมูลไปอย่างมหาศาลแล้วด้วย ซึ่งบางครั้งไม่ได้ขอความยินยอมจากผู้ใช้ด้วย หรือไม่ถ้าขอก็อาจจะเป็นการเขียนเบลอๆ กระทั่งอ่านเงื่อนไขขอความยินยอมของผู้ให้บริการจนจบแล้ว ยังรู้สึกไม่อยากใช้เลย แต่ทำยังไงได้ มันต้องใช้ เพราะไม่มีบริการอื่นให้เลือกใช้ ในแง่นั้นผู้บริโภคไม่ได้มีทางเลือกเท่าไหร่\n\nแต่ทีนี้หลักการของกฎหมายคุ้มครองส่วนบุคคลทั้งของไทยและต่างประเทศบอกว่า ถ้าคุณจะใช้บริการ แล้วบริษัทขอใช้ข้อมูลคุณ ต้องมีเหตุผลและความจำเป็นจริงๆ"
      }
    ]
  }
]
