<template>
  <div class="flex flex-col space-y-12 p-4 py-12 md:py-20 max-w-3xl m-auto">
    <section class="space-y-6">
      <Heading1 class="font-black text-center">เกี่ยวกับโครงการนี้</Heading1>

      <Paragraph1 with-indent>
        รัฐธรรมนูญคือกฎหมายพื้นฐานของรัฐที่มีลำดับศักดิ์สูงสุดเหนือกฎหมายอื่น ๆ
        ซึ่งถือเป็นเครื่องมือในการกำหนดรูปแบบการปกครอง
        และกำหนดกลไกอันเป็นโครงสร้างพื้นฐาน (Infrastructure)
        ในการจัดการองค์กรของรัฐ
        รวมถึงมีวัตถุประสงค์ในการจำกัดอำนาจผู้ปกครองและคุ้มครองสิทธิและเสรีภาพของประชาชน
        เป็นหลักสำคัญ ดังนั้น
        รัฐธรรมนูญจึงเป็นหลักประกันสำคัญทางสิทธิและเสรีภาพของประชาชน
        และเป็นหมุดหมายสำคัญในการเริ่มทำความเข้าใจถึงการวางโครงสร้างทางการเมืองของรัฐ
      </Paragraph1>

      <Paragraph1 with-indent
        >ตั้งแต่ พ.ศ. 2475 จนถึงปัจจุบัน
        ประเทศไทยมีรัฐธรรมนูญมาแล้วจำนวนทั้งสิ้น 20 ฉบับ มากเป็นอันดับ 4
        ของโลกรองจากประเทศเฮติ เวเนซูเอลา และสาธารณรัฐโดมินิกัน
        ซึ่งการประกาศใช้รัฐธรรมนูญกว่า 20 ฉบับ ภายในระยะเวลาเพียง 88 ปี
        นับแต่การเปลี่ยนแปลงการปกครอง
        สะท้อนถึงพลวัตทางการเมืองไทยที่เปลี่ยนแปลงมาโดยตลอด
        การผลัดเปลี่ยนรัฐธรรมนูญแต่ละฉบับ
        ไม่ว่าจะโดยสาเหตุจากการทำรัฐประหารหรือกระบวนการที่เป็นประชาธิปไตย
        นำมาซึ่งการเกิดเหตุการณ์ทางการเมืองต่าง ๆ ตามมา
        โดยรัฐธรรมนูญแต่ละฉบับก็มีลักษณะหลายอย่างที่แตกต่างกันออกไป
        ไม่ว่าจะเป็นเรื่องที่มาของการร่างรัฐธรรมนูญ กระบวนการร่างรัฐธรรมนูญ
        อายุของรัฐธรรมนูญ เนื้อหาภายในของรัฐธรรมนูญ เป็นต้น</Paragraph1
      >

      <Paragraph1 with-indent>
        การศึกษาและทำความเข้าใจรัฐธรรมนูญในแต่ละช่วงประวัติศาสตร์ของประเทศไทย
        จึงเป็นเรื่องสำคัญที่ประชาชนทุกคนควรเข้าถึงได้
        เพื่อให้ประชาชนทุกคนได้ตระหนักรู้ถึงสิทธิและเสรีภาพที่พึงมีและได้รับการคุ้มครองตามรัฐธรรมนูญ
        เพื่อนำไปสู่การริเริ่มและร่วมสร้างฉันทามติร่วมกันที่จะกำหนดกฎเกณฑ์การอยู่ร่วมกันในสังคมอย่างเท่าเทียมและเสมอภาค
      </Paragraph1>

      <Paragraph1 with-indent>
        ในยุคปัจจุบันที่เทคโนโลยีและสื่อสังคมออนไลน์ได้เข้ามามีบทบาทในการพัฒนารูปแบบการสื่อสาร
        ซึ่งทำให้หลายสิ่งที่ยากก็สามารถเข้าถึงได้ง่ายและสะดวกมากขึ้น ELECT
        ได้เล็งเห็นถึงข้อจำกัดสำคัญที่มักแทรกเข้ามาในห้วงความคิดของผู้ที่ตั้งใจจะศึกษาและเรียนรู้รัฐธรรมนูญแต่ละฉบับ
        คือการที่รัฐธรรมนูญไทยมีโครงสร้างทางเนื้อหาที่ซับซ้อน
        ใช้ภาษากฎหมายที่ทำให้คนทั่วไปเข้าใจได้ยาก
        รวมถึงความยาวของรัฐธรรมนูญที่มีตั้งแต่หลายสิบหน้าไปจนถึงหลักร้อยหน้า
        อีกทั้งรัฐธรรมนูญที่เผยแพร่ยังอยู่ในรูปแบบที่ไม่สามารถนำข้อมูลออกมาจัดการ
        วิเคราะห์ และเปรียบเทียบได้อย่างสะดวก</Paragraph1
      >

      <Paragraph1 with-indent>
        ELECT จึงเห็นความสำคัญของการทำความเข้าใจรัฐธรรมนูญทั้ง 20 ฉบับ
        โดยใช้กระบวนการถอดความและวิเคราะห์ลายลักษณ์อักษรที่กำหนดขอบเขตทางอำนาจของตัวแสดงทางการเมืองเหล่านี้เอาไว้
        เพื่อกระตุ้นความสนใจของประชาชนเกี่ยวรัฐธรรม cนูญไทยที่ทุกคนเป็นเจ้าของ
        และหยิบยกเนื้อหาของรัฐธรรมนูญในประเด็นที่ต่าง ๆ
        ไปใช้เพื่อพูดคุยถกเถียงกันบนพื้นฐานของข้อมูลในสังคมแบบประชาธิปไตยต่อไป
      </Paragraph1>
    </section>

    <section class="space-y-6">
      <Heading1 class="font-black text-center">ที่มาของข้อมูล</Heading1>

      <Paragraph1 with-indent>
        สำหรับแหล่งข้อมูลในส่วนของบทบัญญัติของรัฐธรรมนูญ ELECT
        ได้อ้างอิงข้อมูลจากเว็บไซต์ของหน่วยงานและองค์กรต่าง ๆ ดังต่อไปนี้
        <ul class="list-inside list-disc">
          <li>
            สำนักงานเลขาธิการสภาผู้แทนราษฎร
            <LinkExternal href="https://www.parliament.go.th">
              https://www.parliament.go.th
            </LinkExternal>
          </li>
          <li>
            สำนักงานคณะกรรมการกฤษฎีกา
            <LinkExternal href="https://www.krisdika.go.th/web/guest/home">
              https://www.krisdika.go.th/web/guest/home
            </LinkExternal>
          </li>
          <li>
            สถาบันพระปกเกล้า
            <LinkExternal href="http://www.kpi.ac.th/">
              http://www.kpi.ac.th/
            </LinkExternal>
          </li>
        </ul>
      </Paragraph1>

      <Heading2 class="font-black">นโยบายการนำข้อมูลไปใช้ต่อ</Heading2>

      <Paragraph1 with-indent>
        ELECT มีความตั้งใจที่พัฒนาทุกโปรเจ็กต์ให้เป็น Open Source
        และเปิดข้อมูลเป็น Open Data ภายใต้เงื่อนไข Creative Commons
        Attribution-ShareAlike License คือสามารถนำไปเผยแพร่และดัดแปลงได้
        โดยต้องระบุที่มา แต่ห้ามนำไปใช้เพื่อการค้า
        และต้องเผยแพร่งานดัดแปลงโดยใช้สัญญาอนุญาตชนิดเดียวกัน
      </Paragraph1>

      <Paragraph1 with-indent>
        หากมีข้อสงสัยต้องการสอบถามเพิ่มเติม
        ประสงค์แจ้งเปลี่ยนแปลงหรือเพิ่มเติมข้อมูลเพื่อความถูกต้อง
        หรือมีข้อเสนอแนะใด ๆ สามารถติดต่อได้ที่ contact [at] elect.in.th
      </Paragraph1>
    </section>

    <section class="space-y-6">
      <Heading1 class="font-black text-center">อาสาสมัครร่วมพัฒนา</Heading1>

      <Paragraph1>
        <strong>เขียนโปรแกรม 👩‍💻</strong>
        <br />
        <LinkExternal href="https://github.com/rapee">Rapee</LinkExternal>,
        <LinkExternal href="https://github.com/Th1nkK1D">Th1nkK1D</LinkExternal
        >,
        <LinkExternal href="http://github.com/pianpwk">pianpwk</LinkExternal>,
        <LinkExternal href="https://github.com/mixth">mixth</LinkExternal>,
        <LinkExternal href="https://github.com/Thoritie">Thoritie</LinkExternal>
      </Paragraph1>

      <Paragraph1>
        <strong>ออกแบบ 👩‍🎨</strong>
        <br />
        <LinkExternal href="https://www.instagram.com/namsaisupavong/"
          >น้ำใส ศุภวงศ์</LinkExternal
        >
      </Paragraph1>

      <Paragraph1>
        <strong>บรรณาธิการ 👩‍🍳</strong>
        <br />
        ธนิสรา เรืองเดช
      </Paragraph1>

      <Paragraph1>
        <strong>ประสานงานและจัดการอื่นๆ 🧙‍♀️</strong>
        <br />
        <LinkExternal href="https://punchup.world/">Punch Up</LinkExternal>,
        <LinkExternal href="https://www.boonmeelab.com/"
          >Boonmee Lab</LinkExternal
        >, <LinkExternal href="https://ilaw.or.th/"> iLaw</LinkExternal>
      </Paragraph1>

      <Paragraph1 with-indent>
        Reconstitution ได้รับการสนับสนุนทุนในการดำเนินงานจาก National Endowment
        for Democracy (NED) ซึ่งนำมาใช้เป็นต้นทุนในการประสานงานและบริหารจัดการ
        และการจัด Meetup เพื่อดำเนินโครงการ
      </Paragraph1>

      <Paragraph1 with-indent>
        ขอขอบคุณ
        <LinkExternal href="https://adaymagazine.com/"
          >a day magazine</LinkExternal
        >
        ฉบับที่ 243 ที่ริเริ่มกำหนดหัวข้อในธีม ‘Redesign’
        และเชิญชวนเหล่านักออกแบบสาธารณะหลากหลายแขนง รวมถึง ELECT เอง
        เพื่อร่วมคิดไอเดียโปรเจกต์ที่จะร่วมออกแบบสังคมที่ดีกว่า ผ่านการ redesign
        สิ่งรอบตัว จนเราเกิดไอเดียที่จะพัฒนาโปรเจกต์ Reconstitution ขึ้นเพื่อ
        Redesign รัฐธรรมนูญไทยให้ย่อยง่ายและเข้าถึงได้โดยทุกคน - อ่านบทสนทนาของ
        ELECT เกี่ยวกับโปรเจกต์ Reconstitution ได้ที่
        <LinkExternal href="https://godaypoets.com/product/a-day-243/"
          >a day magazine ฉบับที่ 243</LinkExternal
        >
        และใน
        <LinkExternal
          href="https://adaymagazine.com/constitution-change-by-punch-up/"
          >บทความออนไลน์โดย a day</LinkExternal
        >
      </Paragraph1>

      <Paragraph1 with-indent>
        ขอขอบคุณบริษัท
        <LinkExternal href="https://www.ztrus.com">ZTRUS</LinkExternal>
        สำหรับการแปลงข้อมูลรัฐธรรมนูญทั้ง 20 ฉบับออกมาเป็นจากไฟล์ PDF สู่
        Machine readable data ผ่านเครื่องมือ OCR (Optical Character Recognition)
        ที่ทำให้รายละเอียดในรัฐธรรมนูญทุกฉบับสามารถเข้าถึงและจัดการข้อมูลได้สะดวกยิ่งขึ้น
      </Paragraph1>
    </section>

    <section class="space-y-6">
      <Heading1 class="font-black text-center">ร่วมพัฒนาโครงการ</Heading1>

      <Paragraph1 with-indent>
        ตรวจสอบ ติดตาม และร่วมพัฒนาโปรเจ็กท์ได้ทาง Github
        โค้ดบนเว็บไซต์ทั้งหมดถูกเปิดเผยแบบสาธารณะเพื่อความโปร่งใสในการดำเนินการและพัฒนา
        และร่วมเป็นส่วนหนึ่งในการพัฒนา Civil Tech ในประเทศไทย
        หากคุณต้องการแบ่งปันทักษะด้านพัฒนาระบบ ออกแบบ รวบรวมข้อมูล
        หรือแบ่งปันข้อมูล รวมทั้งความช่วยเหลือด้านอื่น ๆ สามารถติดต่อได้ที่
        contact [at] elect.in.th
      </Paragraph1>
    </section>

    <section class="text-center">
      <LinkExternal href="https://github.com/electinth/constitution"
        >View This Project On Github</LinkExternal
      >
    </section>

    <section>
      <SocialSharer />
    </section>
  </div>
</template>

<script lang="ts">
import Vue from 'vue';
import { generateHeadTags } from '~/utils/head';

export default Vue.extend({
  head: generateHeadTags({
    title: 'เกี่ยวกับโครงการ',
  }),
});
</script>
